Even setting `rule_settings` to exactly the suggested default values has the same issue:
```
resource "cloudflare_zero_trust_gateway_policy" "example" {
  account_id  = local.personal_account_id
  name        = "office"
  description = "desc"
  precedence  = 1
  action      = "block"
  filters     = ["http"]
  traffic     = "http.request.uri == \"https://www.example.com/malicious\""
  rule_settings = {
    # Workaround for issue in the provider -- explicitly set default values.
    # https://github.com/cloudflare/terraform-provider-cloudflare/issues/5394#issuecomment-2905137052
    block_page_enabled                 = false
    block_reason                       = ""
    insecure_disable_dnssec_validation = false
    ip_categories                      = false
    ip_indicator_feeds                 = false
    override_host                      = ""
    check_session                      = null
    add_headers                        = null
    l4override                         = null
    biso_admin_controls                = null
  }
  enabled  = true
  identity = "any(identity.saml_attributes[*] == \"groups=CFTAccessKubernetes\")"
}
```
```
Terraform will perform the following actions:
  # cloudflare_zero_trust_gateway_policy.example will be updated in-place
  ~ resource "cloudflare_zero_trust_gateway_policy" "example" {
      ~ created_at     = "2025-07-29T20:31:48Z" -> (known after apply)
      + deleted_at     = (known after apply)
      + expiration     = (known after apply)
        id             = "b28e9bec-e9f2-452c-a0dc-f54795254aa1"
        name           = "office"
      ~ rule_settings  = {
          + biso_admin_controls                = (known after apply)
          + block_page_enabled                 = false
          + block_reason                       = ""
          + insecure_disable_dnssec_validation = false
          + ip_categories                      = false
          + ip_indicator_feeds                 = false
          + override_host                      = ""
      ~ updated_at     = "2025-07-29T20:31:48Z" -> (known after apply)
      ~ version        = 1 -> (known after apply)
      + warning_status = (known after apply)
        # (8 unchanged attributes hidden)
Plan: 0 to add, 1 to change, 0 to destroy.
```

This is using terraform 1.7.3 with cloudflare/cloudflare 5.7.1 (latest).

[plan.redacted.log](https://github.com/user-attachments/files/21496901/plan.redacted.log)